Repository: zeichensatz/wok_photostation
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# javascriptWarning
source: JavaSript is needed for display of the PhotoStation album!
de: Es wird JavaSript für die Anzeige des PhotoStation Albums benötigt!

# constants.scss.PS_height.label
source: $PS_height: Height of PhotoStation content element.
de: $PS_height: Höhe des PhotoStation Content Elements.

# constants.scss.PS_width.label
source: $PS_width: Width of PhotoStation content element.
de: $PS_width: Breite des PhotoStation Content Elements.

# constants.scss.PS_bg_color.label
source: $PS_bg_color: Background color of PhotoStation content element.
de: $PS_bg_color: Hintergrundfarbe des PhotoStation Content Elements.

# constants.scss.PS_padding.label
source: $PS_padding: Width of border around images.
de: $PS_padding: Breite des Rahmens um die Bilder.

# constants.resources.jsSourceFile.label
source: PhotoStation JavaScript Source File: Patched JavaScript file for Lightbox. Will only be included when constant lightbox is set!
de: PhotoStation JavaScript Quelldatei: Angepasste JavaScript-Datei für die Lightbox. Die Datei wird nur eingeschlossen, wenn die Konstante lightbox gesetzt ist!

# constants.resources.cssFile.label
source: PhotoStation CSS File: SCSS/CSS for PhotoStation. If you're using bootstrap_package, leave it to SCSS default file. Otherwise you may use the CSS from EXT:Resources/Public/CSS/custom.css (but you loose ability to use SCSS variables).
de: PhotoStation CSS File: SCSS/CSS Datei für PhotoStation. Wenn man das bootstrap_package verwendet, dann auf der Default SCSS-Datei lassen. Ansonsten das CSS von EXT:Resources/Public/CSS/custom.css verwenden, wobei man die Möglichkeit der Verwendung von SCSS Variablen verliert.

# constants.generalSettings.server.label
source: PhotoStation Server: Web server address of PhotoStation.
de: PhotoStation Server: Webserver Adresse von PhotoStation.

# constants.generalSettings.http.label
source: PhotoStation Server http/https switch: Switch between http/https. Lightbox will only work with https!!
de: PhotoStation Server http/https Schalter: Schalter zwischen http/https. Die Lightbox funktioniert nur mit https!!

# constants.generalSettings.pageString.label
source: PhotoStation Server string: Webpage string for PhotoStation (only change when you know what are you doing!)
de: PhotoStation Server string: Seitenaufruf für die PhotoStation (bitte nur ändern, wenn man wirklich weiß, was man tut!)

# constants.generalSettings.autoplay.label
source: PhotoStation autoplay: Activate autoplay feature. Deactivate with empty string!
de: PhotoStation autoplay: Aktivierung des automatischen Starts. Deaktivierung durch keine Angabe!

# constants.generalSettings.openps.label
source: PhotoStation link: Set a link to PhotoStation. Deactivate with empty string!
de: PhotoStation link: Link zur PhotoStation setzen. Deaktivierung durch keine Angabe!

# constants.generalSettings.lightbox.label
source: PhotoStation lightbox: Activate lightbox feature. Deactivate with empty string!
de: PhotoStation lightbox: Aktivierung der Lightbox. Deaktivierung durch keine Angabe!

# constants.generalSettings.showDescription.label
source: PhotoStation album description: Toggle for display of PhotoStation album description.
de: PhotoStation album description: Schalter zur Ausgabe der Beschreibung des PhotoStation Albums.

# constants.generalSettings.debug.label
source: PhotoStation debug: Toggle for debugging. Displays settings.
de: PhotoStation debug: Schalter fürs Debuggen. Anzeige von settings.

# constants.templates.templateRootPath.label
source: Path to template root (FE).
de: Pfad zu den Templates (FE).

# constants.templates.partialRootPath.label
source: Path to template partials (FE).
de: Pfad zu den Template Partials (FE).

# constants.templates.layoutRootPath.label
source: Path to template layouts (FE).
de: Pfad zu den Template Layouts (FE).

# constants.storage.storagePid.label
source: Default storage PID.
de: Voreingestellte Speicher Page-ID.

# constants.on.label
source: on
de: an

# constants.off.label
source: off
de: aus
